workspace/DataProcessors/АукРабочийСтолАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АукРабочийСтолАукционы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/DataProcessors/АукРабочийСтолАукционы/Forms/ПодведениеИтогов3/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатРасчетаОбновитьИтог();
	
	НастроитьИнтерфейс();
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытием_Продолжить", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Данные были изменены. Сохранить перед закрытием?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытием_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьСохранениеДанных();	
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура тзИтогиАукционаПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		УстановитьОтборПоУчастнику(ТекДанные.Участник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тзИтогиАукционаВыбранУчастникПриИзменении(Элемент)
	ТекДанные = Элементы.тзИтогиАукциона.ТекущиеДанные;
	
	Если ТекДанные.СтатусУчастия = 0 Тогда
		Если ЭтотОбъект.ЭтоПромежуточныеИтоги Тогда
			масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(Новый Структура("УчастникВыбран", Истина));
			
			Если масСтрокиТз.Количество() > 1 Тогда
				Для Каждого СтрокаТз Из масСтрокиТз Цикл
					СтрокаТз.ЭтоПобедитель	= Ложь;
					СтрокаТз.УчастникВыбран = Ложь;
				КонецЦикла;
				
				ТекДанные.УчастникВыбран = Истина;
			КонецЕсли;
			
			Если ТекДанные <> Неопределено Тогда
				ТекДанные.ЭтоПобедитель = ТекДанные.УчастникВыбран;	
			КонецЕсли;
		Иначе
			масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(Новый Структура("Участник, УчастникВыбран", ТекДанные.Участник, Истина));
			
			Если масСтрокиТз.Количество() > 1 Тогда
				Для Каждого ЭлСтрокаТз Из масСтрокиТз Цикл
					Если ЭлСтрокаТз.СтрокаДанных <> ТекДанные.СтрокаДанных Тогда
						ЭлСтрокаТз.УчастникВыбран	= Ложь;
						ЭлСтрокаТз.ЭтоПобедитель	= Ложь;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			ОбновитьОстаткиПараметров();
			
			// 1. Проверить на отрицательный остаток
			Если Не ТекДанные.УчастникВыбран Тогда
				ТекДанные.ЭтоПобедитель	= Ложь;	
			Иначе	
				булМожетБытьПобедителем = Истина;
				Для Каждого СтрокаТз Из ЭтотОбъект.тзПараметрыАукциона Цикл
					масСтрокиПерем = ЭтотОбъект.НастройкаСписания.НайтиСтроки(Новый	Структура("Параметр", СтрокаТз.Параметр));
					
					Если масСтрокиПерем.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					чслТекИтог = 0;
					Для Каждого СтрокаТзПерем Из масСтрокиПерем Цикл
						чслТекИтог = чслТекИтог + ТекДанные[СтрокаТзПерем.СписыватьПоПеременной];			
					КонецЦикла;
					
					Если чслТекИтог > СтрокаТз.Остаток Тогда
						булМожетБытьПобедителем = Ложь;
						
						Прервать;	
					КонецЕсли;	
				КонецЦикла;
				
				ТекДанные.ЭтоПобедитель	= булМожетБытьПобедителем;	
			КонецЕсли;
			
			ОбновитьОстаткиПараметров();
			
			РезультатРасчетаОбновитьИтог();
		КонецЕсли;
		
		Модифицированность = Истина;
	ИначеЕсли ТекДанные.СтатусУчастия = 1 Тогда 
		ТекДанные.УчастникВыбран = Ложь;
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Участник не делал ставки'"));	
	Иначе
		ТекДанные.УчастникВыбран = Ложь;
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Участник отказался от участия'"));	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тзИтогиАукционаПеременнаяПриИзменении(Элемент) // для програмно созданных колонкок
	ТекДанные = Элементы.тзИтогиАукциона.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда	
		стрИмяПеременной = ИмяПеременнойИзКолонкиТаблицыИтогов(Элемент);
		
		ОбработатьИзменениеЗначенияПеременной(стрИмяПеременной, ТекДанные);
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Сохранить(Команда)
	ВыполнитьСохранениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	ВыполнитьСохранениеДанных();
	
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработкаИзмененийЗначенийПеременной

&НаКлиенте
Процедура НастроитьИнтерфейс()
	Если ЭтотОбъект.ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов")
		 И ЭтотОбъект.ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов")
	Тогда
		Элементы.Подтвердить.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура тзПараметрыАукционаТекущееЗначениеПриИзменении(Элемент)
	ТекДанные = Элементы.тзПараметрыАукциона.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		чслИтогТемп = ИтогПоПараметруСписываемомуПоПеременной(ТекДанные.Параметр);	
			
		Если чслИтогТемп > ТекДанные.ТекущееЗначение Тогда
			СнятьФлагиФактическихПобедителейНачинаяСНаименьшего(ТекДанные.Параметр);
		Иначе
			УстановитьФлагиФактическихПобедителейНачинаяСНаибольшего(ТекДанные.Параметр)
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиФактическихПобедителейНачинаяСНаибольшего(пПараметр)	
	сзРаспрСуммы = РаспределяемаяСуммаИзТзИтоговыеДанныеВСписокЗначений(Истина, Ложь);
		
	сзРаспрСуммы.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	АктивироватьПобедительФактическийПоСпискуРаспределяемыхСумм(сзРаспрСуммы, пПараметр, Истина, Ложь);
	
	ОбновитьОстаткиПараметров();
			
	РезультатРасчетаОбновитьИтог();		
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПобедительФактическийПоСпискуРаспределяемыхСумм(пСзРаспрСуммы, пПараметр, пБулУчастникВыбран, пБулЭтоПобедитель)
	Для Каждого ЭлСз Из пСзРаспрСуммы Цикл	
		сткОтбор = Новый Структура("УчастникВыбран, РезультатРасчета", пБулУчастникВыбран, ЭлСз.Значение);
		
		масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(сткОтбор);
		
		Для Каждого ЭлСтрокаТз Из масСтрокиТз Цикл	
			Если (ЭтотОбъект.тзПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", пПараметр))[0].ТекущееЗначение
					- ИтогПоПараметруСписываемомуПоПеременной(пПараметр, Истина)) >= 0 Тогда		
				ЭлСтрокаТз.ЭтоПобедитель = Истина;
			Иначе	
				Возврат;		
			КонецЕсли;		
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагиФактическихПобедителейНачинаяСНаименьшего(пПараметр)
	сзРаспрСуммы = РаспределяемаяСуммаИзТзИтоговыеДанныеВСписокЗначений(Истина, Истина);
		
	сзРаспрСуммы.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ДеактивироватьПобедительФактическийПоСпискуРаспределяемыхСумм(сзРаспрСуммы, пПараметр, Истина, Истина);
	
	ОбновитьОстаткиПараметров();
			
	РезультатРасчетаОбновитьИтог();		
КонецПроцедуры

&НаКлиенте
Процедура ДеактивироватьПобедительФактическийПоСпискуРаспределяемыхСумм(пСзРаспрСуммы, пПараметр, пБулУчастникВыбран, пБулЭтоПобедитель)
	Для Каждого ЭлСз Из пСзРаспрСуммы Цикл	
		сткОтбор = Новый Структура("УчастникВыбран, ЭтоПобедитель, РезультатРасчета", пБулУчастникВыбран, пБулЭтоПобедитель, ЭлСз.Значение);
		
		масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(сткОтбор);
		
		Для Каждого ЭлСтрокаТз Из масСтрокиТз Цикл	
			Если (ЭтотОбъект.тзПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", пПараметр))[0].ТекущееЗначение - ИтогПоПараметруСписываемомуПоПеременной(пПараметр)) < 0 Тогда
				
				ЭлСтрокаТз.ЭтоПобедитель = Ложь;
				
			Иначе	
				Возврат;		
			КонецЕсли;		
		КонецЦикла;		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Функция РаспределяемаяСуммаИзТзИтоговыеДанныеВСписокЗначений(пБулУчастникВыбран, пБулЭтоПобедитель)
	масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(Новый Структура("УчастникВыбран, ЭтоПобедитель", пБулУчастникВыбран, пБулЭтоПобедитель));
	
	сзРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлСтрокаТз Из масСтрокиТз Цикл	
		сзРезультат.Добавить(ЭлСтрокаТз.РезультатРасчета);	
	КонецЦикла;
	
	Возврат сзРезультат;	
КонецФункции
	
&НаКлиенте
Функция ИмяПеременнойИзКолонкиТаблицыИтогов(пЭлемент)
	Возврат СтрЗаменить(пЭлемент.Имя, "тзИтогиАукциона", "");	
КонецФункции	

&НаКлиенте
Процедура ОбработатьИзменениеЗначенияПеременной(пСтрИмяПеременной, пТекДанные)	
	сткРез = ПроверитьВозможностьАктивизацииПобедителяПоСтроке(пТекДанные, пСтрИмяПеременной);
	
	ПересчитатьРезультатРасчетаПоСтроке(пТекДанные);
	
	Если пТекДанные.ЭтоПобедитель Тогда
		Если сткРез.Успех Тогда
			Для Каждого ЭлСоо Из сткРез.Результат Цикл
				масСтрокиПараметры = ЭтотОбъект.тзПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлСоо.Ключ));
				
				масСтрокиПараметры[0].Остаток = масСтрокиПараметры[0].ТекущееЗначение - ЭлСоо.Значение;
			КонецЦикла;
		Иначе
			пТекДанные.ЭтоПобедитель = Ложь;
			
			ОбновитьОстаткиПараметров();		
		КонецЕсли;
	Иначе	
		Если пТекДанные.УчастникВыбран Тогда
			Если сткРез.Успех Тогда
				Для Каждого ЭлСоо Из сткРез.Результат Цикл
					масСтрокиПараметры = ЭтотОбъект.тзПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлСоо.Ключ));
					
					масСтрокиПараметры[0].Остаток = масСтрокиПараметры[0].ТекущееЗначение - ЭлСоо.Значение;
				КонецЦикла;
				
				пТекДанные.ЭтоПобедитель = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	РезультатРасчетаОбновитьИтог();	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьАктивизацииПобедителяПоСтроке(пТекДанные, пСтрИмяПеременной)
	масСтрокиПараметрПоПеременной = ЭтотОбъект.НастройкаСписания.НайтиСтроки(Новый Структура("СписыватьПоПеременной", пСтрИмяПеременной));
	
	булМожетБытьПобедителем = Истина;
	сооТекСумма = Новый Соответствие;
	Для Каждого ЭлМасПараметр Из масСтрокиПараметрПоПеременной Цикл
		масПеременные = ЭтотОбъект.НастройкаСписания.НайтиСтроки(Новый Структура("Параметр", ЭлМасПараметр.Параметр));
		
		чслИтогТемп = 0;
		Для Каждого ЭлМасПеременные Из масПеременные Цикл
			чслИтогТемп = чслИтогТемп + ИтогиАукционаИтогПоКолонкеПоПризнакуОтбора(ЭлМасПеременные.СписыватьПоПеременной);
			
			Если Не пТекДанные.ЭтоПобедитель Тогда
				чслИтогТемп = чслИтогТемп + пТекДанные[ЭлМасПеременные.СписыватьПоПеременной];	
			КонецЕсли;
		КонецЦикла;
		
		масСтрокиПараметры = ЭтотОбъект.тзПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлМасПараметр.Параметр));
		
		Если чслИтогТемп > масСтрокиПараметры[0].ТекущееЗначение Тогда
			булМожетБытьПобедителем = Ложь;
			
			//Прервать;
		КонецЕсли;
		
		сооТекСумма.Вставить(ЭлМасПараметр.Параметр, чслИтогТемп);
	КонецЦикла;
	
	Если булМожетБытьПобедителем Тогда
		Возврат ЭдоОбщий._Успех(сооТекСумма);
	Иначе
		Возврат ЭдоОбщий._Ошибка(сооТекСумма);	
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ПересчитатьРезультатРасчетаПоСтроке(пТекДанные)
	стрФормулаТемп = пТекДанные.ФормулаРасчетаРезультата;
	
	Для Каждого ЭлПеременная Из ЭтотОбъект.Переменные Цикл	
		стрФормулаТемп = СтрЗаменить(стрФормулаТемп, "[" + ЭлПеременная + "]", АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(пТекДанные[ЭлПеременная]));
	КонецЦикла;
	
	пТекДанные.РезультатРасчета = Вычислить(стрФормулаТемп);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиПараметров() 
	Для Каждого СтрокаТзПараметр Из ЭтотОбъект.тзПараметрыАукциона Цикл		
		СтрокаТзПараметр.Остаток = СтрокаТзПараметр.ТекущееЗначение - ИтогПоПараметруСписываемомуПоПеременной(СтрокаТзПараметр.Параметр, Ложь); 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Функция ИтогПоПараметруСписываемомуПоПеременной(пПараметр, пБулПризнакЭтоПобедитель = Истина)
	чслИтогТемп = 0;
	
	масСтрокиПеременные = ЭтотОбъект.НастройкаСписания.НайтиСтроки(Новый Структура("Параметр", пПараметр));
	
	Если масСтрокиПеременные.Количество() <> 0 Тогда
		Для Каждого СтрокаТзПеременные Из масСтрокиПеременные Цикл
			чслИтогТемп = чслИтогТемп + ИтогиАукционаИтогПоКолонкеПоПризнакуОтбора(СтрокаТзПеременные.СписыватьПоПеременной, пБулПризнакЭтоПобедитель);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат чслИтогТемп;
КонецФункции

&НаКлиенте
Функция ИтогиАукционаИтогПоКолонкеПоПризнакуОтбора(пИмяКолонки, пБулПризнакЭтоПобедитель = Истина)
	стрКолонкаПризнак = ?(пБулПризнакЭтоПобедитель, "ЭтоПобедитель", "УчастникВыбран");
	
	чслРез = 0;
	
	Для Каждого СтрокаТз Из ЭтотОбъект.тзИтогиАукциона Цикл
		Если СтрокаТз[стрКолонкаПризнак] Тогда
			чслРез = чслРез + СтрокаТз[пИмяКолонки];
		КонецЕсли;
	КонецЦикла;
	
	Возврат чслРез;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РезультатРасчетаОбновитьИтог()
	масСтрокиТз = ЭтотОбъект.тзИтогиАукциона.НайтиСтроки(Новый Структура("ЭтоПобедитель", Истина));
	
	чслРез = 0;	
	Для Каждого СтрокаТз Из масСтрокиТз Цикл
		чслРез = чслРез + СтрокаТз.РезультатРасчета;	
	КонецЦикла;
	
	ЭтотОбъект.РезультатРасчетаИтог = чслРез;
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьСохранениеДанных()
	сткДанныеДляЗаписи = АукОбщийКлиентСервер.ДанныеПобедителейИзТаблицРезультатов(ЭтотОбъект);
	
	АукОбщийВызовСервера.СохранитьДанныеПобедителейЭтапов(сткДанныеДляЗаписи);
	
	Модифицированность = Ложь;
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	// Заполнение реквизитов формы
	ЭтотОбъект.Аукцион				= Параметры.Аукцион;
	ЭтотОбъект.ВидАукциона			= Параметры.ВидАукциона;
	ЭтотОбъект.НомерЭтапа			= Параметры.НомерЭтапа;
	ЭтотОбъект.ТекущийСтатус		= Параметры.Статус;
	
	ЭтотОбъект.ЭтоПромежуточныеИтоги = (ЭтотОбъект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов"));
		
	сткДанные = ОбщиеДанныеДляЗаполненияТаблицИРасчетаИтогов();
	
	УстановитьЗаголовокФормы(сткДанные);
	
	ЭтотОбъект.Переменные = Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(сткДанные.НастройкаРасчетаИтогов.Переменные, "Переменная"));
	
	СформироватьКолонкиТаблиц(сткДанные); 

    ЗаполнитьТаблицыДанными(сткДанные);
	
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	сзПараметры = Новый СписокЗначений;
	сзПараметры.ЗагрузитьЗначения(ЭтотОбъект.НастройкаСписания.Выгрузить().ВыгрузитьКолонку("Параметр"));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Отображать", Ложь));
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "тзПараметрыАукциона.Параметр", "НеВСписке", сзПараметры);
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "тзПараметрыАукционаОстаток, тзПараметрыАукционаТекущееЗначение");	
КонецПроцедуры	

&НаСервере
Функция ОбщиеДанныеДляЗаполненияТаблицИРасчетаИтогов()
	сткДанные = Новый Структура;
	
	сткДанные.Вставить("Аукцион",				Параметры.Аукцион);
	сткДанные.Вставить("НомерЭтапа",			Параметры.НомерЭтапа);
	сткДанные.Вставить("ВидАукциона",			Параметры.ВидАукциона);
	сткДанные.Вставить("ЭтоПромежуточныеИтоги",	ЭтотОбъект.ЭтоПромежуточныеИтоги);
	
	АукОбщийСервер.ОкончательныеИтоги_ДополнительныеПараметры_(сткДанные);
	
	Возврат сткДанные;
КонецФункции	

&НаСервере
Процедура УстановитьЗаголовокФормы(пСткДанные)
	Если ЭтотОбъект.ЭтоПромежуточныеИтоги Тогда
		ЭтотОбъект.Заголовок = СтрШаблон(НСтр("ru = 'Подведение итогов этапа %1'"), пСткДанные.НомерЭтапа);	
	Иначе
		ЭтотОбъект.Заголовок = НСтр("ru = 'Подведение итогов'");	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура СформироватьКолонкиТаблиц(пСткДанные) 
	
	АукОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, пСткДанные.ВидАукциона, "тзИтогиАукциона",
																Элементы.тзИтогиАукционаГруппаДанныеСтавки, пСткДанные.СтруктураСтавки, Ложь);
																
	АукОбщийСервер.ДобавитьКолонкиПеременныхРасчетаИтога(ЭтотОбъект, "тзИтогиАукциона", Элементы.тзИтогиАукционаГруппаПеременные,
															пСткДанные.НастройкаРасчетаИтогов.Переменные, "тзИтогиАукционаПеременнаяПриИзменении");
	
	АукОбщийСервер.ДобавитьКолонкиНачальныхДанныхПоАукциону(ЭтотОбъект, пСткДанные.ВидАукциона, "тзНачальныеДанныеУчастников",
																Элементы.тзНачальныеДанныеУчастниковГруппа, пСткДанные.СтруктураНачальныхДанных, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыДанными(пСткДанные)	
	ЗаполнитьНачальныеДанные(пСткДанные.НачальныеДанные);
	
	сткРезИтоги = АукОбщийСервер.ОкончательныеИтоги_ДанныеСтавокУчастников_(пСткДанные);
	
	ЗаполнитьИтогиАукциона(сткРезИтоги.тзИтогиАукциона);
	
	ЗаполнитьПараметрыАукциона(сткРезИтоги.тзПараметрыАукциона);
	
	ЗаполнитьНастройкуСписания(пСткДанные.НастройкаРасчетаИтогов.НастройкаСписания);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуСписания(пТзНастройкаСписания)
	Для Каждого СтрокаТз Из пТзНастройкаСписания Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.НастройкаСписания.Добавить(), СтрокаТз);	
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИтогиАукциона(пТзИтогиАукциона)
	Для Каждого СтрокаТз Из пТзИтогиАукциона Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.тзИтогиАукциона.Добавить(), СтрокаТз);	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыАукциона(пТзПараметрыАукциона)
	Для Каждого СтрокаТз Из пТзПараметрыАукциона Цикл	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.тзПараметрыАукциона.Добавить(), СтрокаТз); 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеДанные(пНачальныеДанные)
	Для Каждого ЭлементМас Из пНачальныеДанные Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.тзНачальныеДанныеУчастников.Добавить(), ЭлементМас); 	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУчастнику(пУчастник)	
	Элементы.тзНачальныеДанныеУчастников.ОтборСтрок = Новый ФиксированнаяСтруктура("Участник", пУчастник);
КонецПроцедуры

#КонецОбласти
